app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks" WHERE "stocks"."asi_component" = ?  [["asi_component", 1]]
---
 def recommendations
   stocks_1 = []
   stocks_2 = []
   Stock.where(asi_component: 1).each do |i|

SELECT "stocks".* FROM "stocks" WHERE "stocks"."id" = ?  [["id", 1]]
SELECT "stocks".* FROM "stocks"
---
 def index
   if !Stock.find_by(id: 1)
     make_dict
   end
   if !Stock.find_by(id: 2).pe
     populate_data
   else
     update_versus_index
   end
   @stocks = Stock.all