app/controllers/tokens_controller.rb

INSERT INTO "oauths" ("token", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["token", "s4hQvwAAAAAAg9XwAAABTxTQgsk"], ["secret", "NIF0QNcxovewt3ROq7QhHGVXVxpCYRVY"], ["created_at", "2015-08-09 23:34:13.329023"], ["updated_at", "2015-08-09 23:34:13.329023"]]
---
  def request_token
    oauth_callback = url_for(controller:'tokens', action:'access_token')
    request_token = TWITTER.get_request_token(oauth_callback: oauth_callback)
    Oauth.create(token: request_token.token, secret: request_token.secret)

SELECT  "oauths".* FROM "oauths" WHERE "oauths"."token" = ? LIMIT 1  [["token", "s4hQvwAAAAAAg9XwAAABTxTQgsk"]]
INSERT INTO "users" ("uid", "handle", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", "31487946"], ["handle", "alookatomorrow"], ["created_at", "2015-08-09 23:34:14.613652"], ["updated_at", "2015-08-09 23:34:14.613652"]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "31487946"]]
---
  def access_token
    oauth = Oauth.find_by(token: params[:oauth_token])
    if oauth.present?
      request_token = OAuth::RequestToken.new(TWITTER, oauth.token, oauth.secret)
      access_token = request_token.get_access_token(oauth_verifier: params[:oauth_verifier])
      user = User.find_or_create_by(uid: access_token.params[:user_id], ) { |u| u.handle = access_token.params[:screen_name] }