app/controllers/users_controller.rb

UPDATE "users" SET "risk_preference" = ?, "age" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["risk_preference", 14], ["age", 41], ["updated_at", "2015-08-10 00:42:56.592549"], ["id", 2]]
---
  def update
    current_user.update_attributes(info_params)